docs/evidence/perf/sweep-win-threads-50.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/load.js
        output: -

     scenarios: (100.00%) 2 scenarios, 55 max VUs, 1m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 20s (exec: traffic, gracefulStop: 30s)
              * measure: 50 looping VUs for 45s (exec: traffic, startTime: 25s, gracefulStop: 30s)


Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

running (0m07.0s), 05/55 VUs, 5 complete and 0 interrupted iterations
warmup    [   1% ] 5 VUs    00.3s/20s
measure • [   0% ] waiting  24.7s

running (0m08.0s), 05/55 VUs, 35 complete and 0 interrupted iterations
warmup    [   6% ] 5 VUs    01.3s/20s
measure • [   0% ] waiting  23.7s

running (0m09.0s), 05/55 VUs, 70 complete and 0 interrupted iterations
warmup    [  11% ] 5 VUs    02.3s/20s
measure • [   0% ] waiting  22.7s

running (0m10.0s), 05/55 VUs, 110 complete and 0 interrupted iterations
warmup    [  16% ] 5 VUs    03.3s/20s
measure • [   0% ] waiting  21.7s

running (0m11.0s), 05/55 VUs, 150 complete and 0 interrupted iterations
warmup    [  21% ] 5 VUs    04.3s/20s
measure • [   0% ] waiting  20.7s

running (0m12.0s), 05/55 VUs, 190 complete and 0 interrupted iterations
warmup    [  26% ] 5 VUs    05.3s/20s
measure • [   0% ] waiting  19.7s

running (0m13.0s), 05/55 VUs, 230 complete and 0 interrupted iterations
warmup    [  31% ] 5 VUs    06.3s/20s
measure • [   0% ] waiting  18.7s

running (0m14.0s), 05/55 VUs, 273 complete and 0 interrupted iterations
warmup    [  36% ] 5 VUs    07.3s/20s
measure • [   0% ] waiting  17.7s

running (0m15.0s), 05/55 VUs, 315 complete and 0 interrupted iterations
warmup    [  41% ] 5 VUs    08.3s/20s
measure • [   0% ] waiting  16.7s

running (0m16.0s), 05/55 VUs, 360 complete and 0 interrupted iterations
warmup    [  46% ] 5 VUs    09.3s/20s
measure • [   0% ] waiting  15.7s

running (0m17.0s), 05/55 VUs, 400 complete and 0 interrupted iterations
warmup    [  51% ] 5 VUs    10.3s/20s
measure • [   0% ] waiting  14.7s

running (0m18.0s), 05/55 VUs, 445 complete and 0 interrupted iterations
warmup    [  56% ] 5 VUs    11.3s/20s
measure • [   0% ] waiting  13.7s

running (0m19.0s), 05/55 VUs, 485 complete and 0 interrupted iterations
warmup    [  61% ] 5 VUs    12.3s/20s
measure • [   0% ] waiting  12.7s

running (0m20.0s), 05/55 VUs, 530 complete and 0 interrupted iterations
warmup    [  66% ] 5 VUs    13.3s/20s
measure • [   0% ] waiting  11.7s

running (0m21.0s), 05/55 VUs, 570 complete and 0 interrupted iterations
warmup    [  71% ] 5 VUs    14.3s/20s
measure • [   0% ] waiting  10.7s

running (0m22.0s), 05/55 VUs, 615 complete and 0 interrupted iterations
warmup    [  76% ] 5 VUs    15.3s/20s
measure • [   0% ] waiting  09.7s

running (0m23.0s), 05/55 VUs, 655 complete and 0 interrupted iterations
warmup    [  81% ] 5 VUs    16.3s/20s
measure • [   0% ] waiting  08.7s

running (0m24.0s), 05/55 VUs, 700 complete and 0 interrupted iterations
warmup    [  86% ] 5 VUs    17.3s/20s
measure • [   0% ] waiting  07.7s

running (0m25.0s), 05/55 VUs, 740 complete and 0 interrupted iterations
warmup    [  91% ] 5 VUs    18.3s/20s
measure • [   0% ] waiting  06.7s

running (0m26.0s), 05/55 VUs, 785 complete and 0 interrupted iterations
warmup    [  96% ] 5 VUs    19.3s/20s
measure • [   0% ] waiting  05.7s

running (0m27.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  04.7s

running (0m28.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  03.7s

running (0m29.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  02.7s

running (0m30.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  01.7s

running (0m31.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  00.7s

running (0m32.0s), 50/55 VUs, 855 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   1% ] 50 VUs  00.3s/45s

running (0m33.0s), 50/55 VUs, 1150 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   3% ] 50 VUs  01.3s/45s

running (0m34.0s), 50/55 VUs, 1502 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   5% ] 50 VUs  02.3s/45s

running (0m35.0s), 50/55 VUs, 1872 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   7% ] 50 VUs  03.3s/45s

running (0m36.0s), 50/55 VUs, 2245 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   9% ] 50 VUs  04.3s/45s

running (0m37.0s), 50/55 VUs, 2599 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  12% ] 50 VUs  05.3s/45s

running (0m38.0s), 50/55 VUs, 2968 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  14% ] 50 VUs  06.3s/45s

running (0m39.0s), 50/55 VUs, 3360 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  16% ] 50 VUs  07.3s/45s

running (0m40.0s), 50/55 VUs, 3763 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  18% ] 50 VUs  08.3s/45s

running (0m41.0s), 50/55 VUs, 4174 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  21% ] 50 VUs  09.3s/45s

running (0m42.0s), 50/55 VUs, 4584 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  23% ] 50 VUs  10.3s/45s

running (0m43.0s), 50/55 VUs, 4987 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  25% ] 50 VUs  11.3s/45s

running (0m44.0s), 50/55 VUs, 5421 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  27% ] 50 VUs  12.3s/45s

running (0m45.0s), 50/55 VUs, 5846 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  29% ] 50 VUs  13.3s/45s

running (0m46.0s), 50/55 VUs, 6178 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  32% ] 50 VUs  14.3s/45s

running (0m47.0s), 50/55 VUs, 6611 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  34% ] 50 VUs  15.3s/45s

running (0m48.0s), 50/55 VUs, 7059 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  36% ] 50 VUs  16.3s/45s

running (0m49.0s), 50/55 VUs, 7493 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  38% ] 50 VUs  17.3s/45s

running (0m50.0s), 50/55 VUs, 7902 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  41% ] 50 VUs  18.3s/45s

running (0m51.0s), 50/55 VUs, 8322 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  43% ] 50 VUs  19.3s/45s

running (0m52.0s), 50/55 VUs, 8761 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  45% ] 50 VUs  20.3s/45s

running (0m53.0s), 50/55 VUs, 9199 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  47% ] 50 VUs  21.3s/45s

running (0m54.0s), 50/55 VUs, 9648 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  49% ] 50 VUs  22.3s/45s

running (0m55.0s), 50/55 VUs, 10088 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  52% ] 50 VUs  23.3s/45s

running (0m56.0s), 50/55 VUs, 10536 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  54% ] 50 VUs  24.3s/45s

running (0m57.0s), 50/55 VUs, 10986 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  56% ] 50 VUs  25.3s/45s

running (0m58.0s), 50/55 VUs, 11430 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  58% ] 50 VUs  26.3s/45s

running (0m59.0s), 50/55 VUs, 11871 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  61% ] 50 VUs  27.3s/45s

running (1m00.0s), 50/55 VUs, 12321 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  63% ] 50 VUs  28.3s/45s

running (1m01.0s), 50/55 VUs, 12740 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  65% ] 50 VUs  29.3s/45s

running (1m02.0s), 50/55 VUs, 13179 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  67% ] 50 VUs  30.3s/45s

running (1m03.0s), 50/55 VUs, 13629 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  69% ] 50 VUs  31.3s/45s

running (1m04.0s), 50/55 VUs, 14079 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  72% ] 50 VUs  32.3s/45s

running (1m05.0s), 50/55 VUs, 14514 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  74% ] 50 VUs  33.3s/45s

running (1m06.0s), 50/55 VUs, 14963 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  76% ] 50 VUs  34.3s/45s

running (1m07.0s), 50/55 VUs, 15397 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  78% ] 50 VUs  35.3s/45s

running (1m08.0s), 50/55 VUs, 15843 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  81% ] 50 VUs  36.3s/45s

running (1m09.0s), 50/55 VUs, 16291 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  83% ] 50 VUs  37.3s/45s

running (1m10.0s), 50/55 VUs, 16741 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  85% ] 50 VUs  38.3s/45s

running (1m11.0s), 50/55 VUs, 17187 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  87% ] 50 VUs  39.3s/45s

running (1m12.0s), 50/55 VUs, 17626 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  89% ] 50 VUs  40.3s/45s

running (1m13.0s), 50/55 VUs, 18063 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  92% ] 50 VUs  41.3s/45s

running (1m14.0s), 50/55 VUs, 18515 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  94% ] 50 VUs  42.3s/45s

running (1m15.0s), 50/55 VUs, 18948 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  96% ] 50 VUs  43.3s/45s

running (1m16.0s), 50/55 VUs, 19261 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  98% ] 50 VUs  44.3s/45s


  █ THRESHOLDS 

    checks{phase:measure}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{phase:measure}
    ✓ 'p(95)<500' p(95)=12.4ms

    http_req_failed{phase:measure}
    ✓ 'rate<0.01' rate=0.74%


  █ TOTAL RESULTS 

    checks_total.......: 156920  2043.103907/s
    checks_succeeded...: 100.00% 156920 out of 156920
    checks_failed......: 0.00%   0 out of 156920

    ✓ list 200
    ✓ list 비어있지 않음
    ✓ orders 200
    ✓ orders 인증됨
    ✓ orders 최소 건수
    ✓ order 처리됨

    CUSTOM
    resp_2xx.......................: 78003 1015.601798/s
    resp_409_conflict..............: 557   7.25216/s
    resp_error_coded...............: 557   7.25216/s
    setup_requests.................: 100   1.302004/s

    HTTP
    http_req_duration..............: avg=4.73ms  min=35.6µs   med=2.84ms   p(95)=12.5ms   p(99)=29.05ms  max=322.14ms
      { expected_response:true }...: avg=4.7ms   min=35.6µs   med=2.81ms   p(95)=12.41ms  p(99)=28.9ms   max=322.14ms
      { phase:measure }............: avg=4.63ms  min=35.6µs   med=2.76ms   p(95)=12.4ms   p(99)=27.64ms  max=207.24ms
    http_req_failed................: 0.70% 557 out of 78560
      { phase:measure }............: 0.74% 557 out of 75180
    http_reqs......................: 78560 1022.853957/s

    EXECUTION
    iteration_duration.............: avg=119.9ms min=107.71ms med=113.65ms p(95)=145.24ms p(99)=218.18ms max=483.84ms
    iterations.....................: 19615 255.387988/s
    vus............................: 50    min=0            max=50
    vus_max........................: 55    min=55           max=55

    NETWORK
    data_received..................: 82 MB 1.1 MB/s
    data_sent......................: 17 MB 217 kB/s



running (1m16.8s), 00/55 VUs, 19615 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s